{
  "nodes": [
    {
      "id": "hub",
      "label": "NAMCS HC Component",
      "detail": "EHR based encounter submissions powering microdata, dashboards, and linkage products for research",
      "group": "hub",
      "who": "Primary stakeholders include healthcare providers at participating ambulatory care centers who submit encounter data through their EHR systems. Researchers, epidemiologists, health services analysts, policy makers at federal and state levels, and public health officials utilize the resulting data products. Academic institutions, government agencies like CDC and CMS, and healthcare organizations rely on this system for evidence-based decision making.",
      "what": "The NAMCS Health Center Component is a comprehensive data infrastructure that transforms electronic health record encounters into research-ready data products. It serves as the central hub that processes standardized ambulatory care encounter submissions and produces three distinct data product pillars: microdata files for statistical analysis, interactive dashboards for exploratory analysis, and linkage capabilities for longitudinal outcome studies. This system represents a modern evolution of traditional survey-based data collection, leveraging existing EHR systems to capture real-world ambulatory care patterns at scale.",
      "when": "Encounter data is collected continuously throughout the year from participating health centers as patients receive ambulatory care services. Data processing occurs on an ongoing basis with quality checks and standardization applied in near real-time. Release schedules vary by product type: preliminary dashboard estimates are published biannually, public microdata files are released annually approximately 18-24 months after the collection year, and restricted files become available following additional disclosure review processes.",
      "where": "Data originates from participating federally qualified health centers and community health centers distributed across all U.S. states and territories, representing diverse geographic and demographic populations. The data infrastructure is maintained by the National Center for Health Statistics (NCHS) within the Centers for Disease Control and Prevention. Access points vary by product: public files are available via the NCHS website, dashboards are accessible through online platforms, and restricted data requires physical or remote access to Federal Statistical Research Data Centers located throughout the United States.",
      "why": "This system addresses critical gaps in national ambulatory care surveillance by providing timely, comprehensive, and representative data on healthcare delivery patterns, patient characteristics, and treatment practices. It enables evidence-based policy development, quality improvement initiatives, health services research, and public health monitoring of disease trends and healthcare utilization. By modernizing data collection through EHR integration, it reduces provider burden compared to traditional paper-based surveys while dramatically increasing sample sizes and geographic coverage, ultimately improving the nation's capacity to monitor and improve healthcare quality and access.",
      "which": "The system offers three primary data product categories to serve different user needs and analytical purposes: microdata files (both public use and restricted access versions) for researchers conducting custom statistical analyses, interactive web-based dashboards for users seeking quick insights without programming, and linkage files connecting encounter data to external sources like mortality records and social program data. Each product type is designed with different balance points between data detail, accessibility, timeliness, and confidentiality protection. Users can select products based on their research questions, technical capabilities, data access permissions, and timeliness requirements.",
      "how": "Participating health centers extract standardized encounter data from their EHR systems using technical specifications and data dictionaries provided by NCHS. These submissions undergo automated validation checks, quality assurance processes, and statistical weighting procedures to ensure national representativeness. The cleaned and weighted data feeds into three parallel processing pipelines: one creates disclosure-protected microdata files with varying levels of detail, another populates interactive dashboard databases with pre-computed estimates and visualizations, and a third implements probabilistic matching algorithms to link encounters with external data sources. All processes incorporate privacy protections including de-identification, disclosure review, and secure access controls appropriate to each product's sensitivity level."
    },
    {
      "id": "microdata",
      "label": "Microdata",
      "detail": "Visit level datasets for analysis, public sample plus restricted detail files",
      "group": "pillar",
      "who": "Primary users include academic researchers at universities and research institutions conducting health services research, biostatistics graduate students learning advanced analytical methods, and data scientists at healthcare organizations analyzing care patterns. Government analysts at agencies like AHRQ, CMS, and state health departments use these files for policy evaluation and program assessment. Epidemiologists and public health researchers leverage the microdata for disease surveillance, treatment trend analysis, and disparities research across diverse ambulatory care settings.",
      "what": "Microdata files are individual encounter-level datasets where each record represents a single patient visit to an ambulatory care setting, containing detailed information about patient demographics, diagnoses, procedures, medications, and visit characteristics. These files are available in two access tiers: public use files with disclosure protections applied through variable suppression and geographic aggregation, and restricted detail files containing finer-grained information including additional clinical variables, precise geographic identifiers, and linkage keys. The files are structured as rectangular datasets compatible with standard statistical software packages (SAS, STATA, R, SPSS) and include comprehensive documentation, codebooks, and survey weights to support nationally representative analyses.",
      "when": "Public use microdata files are released on an annual cycle, typically becoming available 18-24 months after the end of the data collection year to allow for thorough data cleaning, weighting, and disclosure review processes. Restricted detail files follow a slightly longer timeline, often released 24-30 months post-collection due to additional disclosure analysis requirements. Once released, files remain available indefinitely, allowing researchers to conduct longitudinal analyses across multiple years and track trends in ambulatory care delivery over time.",
      "where": "Public use files are freely accessible for download through the National Center for Health Statistics (NCHS) website and the CDC WONDER data portal, with no special permissions or facility access required. Restricted detail files are available exclusively through the Federal Statistical Research Data Center (FSRDC) network, which includes approximately 30 secure facilities located at universities, Census Bureau offices, and federal agencies across the United States. Remote access to restricted files is also available through secure virtual desktop environments for approved researchers unable to travel to physical RDC locations.",
      "why": "Microdata files serve as the foundation for rigorous statistical research on ambulatory care by providing the flexibility to conduct custom analyses tailored to specific research questions that pre-tabulated data cannot address. They enable researchers to examine complex relationships between variables, control for confounding factors, test hypotheses using appropriate statistical models, and generate new insights about healthcare quality, access, costs, and outcomes. The availability of both public and restricted tiers democratizes access to ambulatory care data while still enabling sensitive research that requires more detailed information, supporting the full spectrum from educational exercises to cutting-edge policy research.",
      "which": "The microdata pillar consists of two distinct file types designed for different analytical needs and disclosure protection requirements: public use files that balance accessibility with privacy protection through strategic variable suppression and categorization, and restricted detail files that preserve finer granularity for researchers with approved proposals and secure access. Within each year's release, files may include multiple survey components or supplements covering specific topics like mental health, telemedicine, or preventive services. Files are available in multiple statistical software formats (CSV, SAS, STATA) to accommodate different analytical workflows and technical preferences.",
      "how": "Public files are accessed through direct download from the NCHS website after reviewing data use agreements and documentation, requiring no application or approval process. Restricted files require a formal application process where researchers submit detailed proposals describing their research objectives, methodologies, and public benefit justification to the NCHS Ethics Review Board. Approved researchers access restricted data by scheduling time at a physical FSRDC facility or connecting via secure remote access, working in an isolated computing environment where all output undergoes disclosure review before release. Both file types include complex survey design variables (strata, clusters, weights) that users must properly incorporate into analyses to generate nationally representative estimates with correct variance calculations."
    },
    {
      "id": "dashboards",
      "label": "Dashboards",
      "detail": "Interactive preliminary estimates for people who do not want to code",
      "group": "pillar",
      "who": "Primary users include policy makers at federal, state, and local health departments who need current data for decision-making but lack statistical programming expertise. Healthcare administrators, quality improvement officers, and clinicians at health systems use dashboards to benchmark their performance against national trends. Journalists, patient advocacy groups, and healthcare consultants access these tools to understand and communicate ambulatory care patterns to broader audiences without requiring technical data analysis skills.",
      "what": "Interactive dashboards are web-based data visualization platforms that allow users to explore ambulatory care statistics through point-and-click interfaces without writing any code or using statistical software. These tools present preliminary estimates across key metrics such as visit volume, diagnostic patterns, medication prescribing trends, preventive service delivery, and demographic breakdowns through charts, graphs, maps, and tables. Users can filter, compare, and drill down into data using intuitive controls, creating custom views that answer specific questions about ambulatory care delivery patterns and trends over time.",
      "when": "Dashboard content is updated on a biannual (twice-yearly) schedule, typically releasing preliminary estimates for the most recent 6-month period approximately 3-6 months after data collection ends. This release cadence provides data 12-18 months faster than final microdata files, offering timely insights into emerging trends and current healthcare delivery patterns. Updates occur on a predictable schedule (typically spring and fall releases) to help users plan for when new data will become available, and historical data remains accessible to support trend analysis across multiple time periods.",
      "where": "Dashboards are publicly accessible through the NCHS website and CDC's data visualization portals, requiring only an internet connection and modern web browser with no special software installation or data center access. The platforms are designed to work across devices including desktop computers, tablets, and smartphones, enabling access from offices, homes, or mobile settings. No account registration, application, or approval process is required, making these tools the most accessible entry point for exploring NAMCS ambulatory care data.",
      "why": "Dashboards dramatically expand the user base for NAMCS data by eliminating technical barriers that prevent non-programmers from accessing insights, democratizing data use beyond the traditional research community. They address the critical timeliness gap inherent in microdata production by providing preliminary estimates much faster than final files, enabling more responsive policy and practice decisions. By offering pre-computed, quality-assured estimates with intuitive visualizations, dashboards reduce the risk of analytical errors that can occur when non-experts attempt complex statistical programming, while still providing the flexibility to explore data from multiple angles.",
      "which": "The dashboard suite includes multiple specialized tools serving different analytical purposes: trend dashboards showing changes over time in key ambulatory care metrics, comparison dashboards enabling benchmarking across geographic regions or patient populations, topic-specific dashboards focused on areas like chronic disease management or preventive services, and downloadable table generators that produce publication-ready summary statistics. Users can choose between different visualization types (bar charts, line graphs, heat maps, tables) and export formats (PNG images, Excel spreadsheets, CSV files, PDF reports) based on their communication needs. Each dashboard includes contextual help, methodology notes, and interpretation guidance to support accurate use.",
      "how": "Users interact with dashboards through intuitive graphical interfaces featuring dropdown menus, checkboxes, sliders, and buttons to select variables, filters, time periods, and comparison groups of interest. The underlying system queries pre-computed estimate databases and dynamically generates visualizations based on user selections, applying appropriate statistical methods and uncertainty measures behind the scenes. Export functionality allows users to download both the visualizations (as image files for presentations) and underlying data (as spreadsheets or CSV files for further manipulation), with all exports including proper citations and methodology references. The system automatically handles complex survey weighting and variance estimation, presenting results with confidence intervals and significance testing where appropriate, ensuring statistical rigor without requiring users to understand the underlying statistical methods."
    },
    {
      "id": "linkage",
      "label": "Linkage",
      "detail": "Patient level links to external sources to add outcomes and social context",
      "group": "pillar",
      "who": "Primary users are health services researchers and epidemiologists investigating long-term health outcomes following ambulatory care encounters, including survival analysis and mortality risk factors. Social determinants of health researchers studying the intersection of healthcare, housing, income support, and other social factors rely on these linkages to understand how social context influences health and healthcare utilization. Population health researchers, health economists, and policy analysts use linked data to evaluate program effectiveness, assess care quality through downstream outcomes, and examine health equity across socioeconomic groups.",
      "what": "The linkage pillar provides patient-level connections between NAMCS ambulatory care encounter records and external administrative data sources, creating enriched longitudinal datasets that extend beyond the point of care. These linkages add critical outcome information (such as mortality status and cause of death) and social context variables (such as housing assistance participation, nutritional support program enrollment) that are not captured in clinical encounter data alone. The linked files maintain the encounter-level structure of NAMCS microdata while appending matched information from external sources, enabling researchers to follow patients beyond their ambulatory visits and examine relationships between healthcare encounters, social circumstances, and long-term outcomes.",
      "when": "Linkage files are available for approved research projects after successful completion of formal proposal review and data access authorization processes, which typically take 3-6 months from initial application to data access. The availability of specific linkages depends on the time lag required for external data sources to become available and complete matching procedures, generally making linked data accessible 2-3 years after the ambulatory care encounter occurred. Once established, linkages may be updated periodically as additional follow-up time accrues or as external data sources receive updates, allowing researchers to conduct studies with varying follow-up periods based on their research questions.",
      "where": "All linkage files are classified as restricted-use data and are accessible exclusively within the secure environment of Federal Statistical Research Data Centers (FSRDCs) located at approximately 30 sites nationwide, or through secure remote access virtual desktop infrastructure. Physical RDC locations are strategically distributed across the United States at universities, Census Bureau regional offices, and federal agency facilities to provide geographic access while maintaining strict security protocols. Remote access options expanded in recent years to improve accessibility for researchers without convenient physical RDC access, though all work still occurs in isolated, monitored computing environments with comprehensive disclosure review of all output.",
      "why": "Linkages address fundamental limitations of cross-sectional encounter data by enabling longitudinal follow-up and outcome assessment, which is essential for evaluating healthcare quality, effectiveness of treatments, and long-term impacts of ambulatory care interventions. They provide crucial social determinants of health context that clinical records alone cannot capture, supporting research on how housing instability, poverty, and social program participation interact with healthcare access and health outcomes. By connecting healthcare encounters with external outcome and contextual data, linkages enable more comprehensive research on health equity, population health management, and the effectiveness of healthcare delivery across diverse social contexts, ultimately informing more holistic and effective health policies.",
      "which": "Current linkage offerings include connections to the National Death Index (NDI) providing mortality outcomes with cause-of-death information, and links to Department of Housing and Urban Development (HUD) administrative records capturing housing assistance program participation. Future linkage opportunities may expand to include Medicare and Medicaid claims data for healthcare utilization patterns, Supplemental Nutrition Assistance Program (SNAP) enrollment for food security context, Social Security Administration earnings data for economic stability measures, and other relevant administrative data sources. Researchers can request single linkages or combinations of multiple linked data sources depending on their research questions, with each linkage subject to separate approval, feasibility assessment, and privacy protection review.",
      "how": "Linkages are created through sophisticated probabilistic and deterministic matching algorithms that compare personal identifiers (such as name, date of birth, Social Security Number, address) between NAMCS encounter records and external data sources while following strict privacy protection protocols. Matching procedures use specialized software and methodologies that account for data entry errors, name changes, and missing information to maximize match rates while minimizing false matches. The matching process is conducted in secure environments by authorized data linking specialists, with match quality assessed through validation studies and sensitivity analyses. Approved researchers receive linked analytical files where matched records are connected via anonymous linkage keys, with all direct identifiers removed to protect confidentiality, and must complete all analyses within the secure FSRDC environment with comprehensive output review before results can be released."
    },
    {
      "id": "public_file",
      "label": "Public file",
      "detail": "Accessible microdata tier designed to lower cost and compute barriers",
      "group": "sub",
      "who": "Primary users include undergraduate and graduate students in public health, biostatistics, health services research, and related fields who use the data for coursework, thesis projects, and learning statistical analysis techniques. Early-career researchers at institutions without FSRDC access, independent researchers and consultants working outside major academic institutions, and analysts at non-profit organizations, advocacy groups, and small healthcare organizations utilize public files for policy analysis and program evaluation. International researchers interested in studying U.S. ambulatory care patterns also rely on public files as they cannot access restricted data in Federal Statistical Research Data Centers.",
      "what": "The public use file is a freely downloadable, de-identified microdata file containing visit-level records with disclosure protections applied through variable suppression, top-coding, categorization, and geographic aggregation to prevent re-identification while preserving analytical utility. Each record represents an individual ambulatory care encounter and includes hundreds of variables covering patient demographics, clinical diagnoses, procedures performed, medications prescribed, visit characteristics, and provider information, along with complex survey design variables (sampling weights, strata, cluster identifiers) necessary for generating nationally representative estimates. The file is distributed in multiple statistical software formats (SAS, STATA, SPSS, R, CSV) and includes comprehensive documentation, codebooks, and example analysis programs to facilitate proper use.",
      "when": "Public use files are released annually on a predictable schedule, typically 18-24 months after the end of each data collection year to allow time for data cleaning, quality assurance, statistical weighting procedures, and disclosure avoidance review. Release dates are generally announced in advance through NCHS communications channels, allowing researchers to plan analyses and anticipate data availability. Once released, files remain permanently available for download, enabling researchers to access historical data for trend analyses spanning multiple years and to replicate previous studies or conduct new secondary analyses on existing data years.",
      "where": "Public files are accessible through direct download from the National Center for Health Statistics (NCHS) Data and Statistics page on the CDC website, requiring only an internet connection and no institutional affiliation or special permissions. The files can be downloaded to any computing environment including personal laptops, university computing clusters, cloud computing platforms, or organizational servers, giving researchers complete flexibility in their analytical infrastructure. Download sites include detailed documentation, data dictionaries, survey methodology reports, and links to related resources, providing a comprehensive self-service resource for researchers worldwide.",
      "why": "Public files serve the critical mission of democratizing access to national ambulatory care data by eliminating financial, institutional, and logistical barriers that would otherwise restrict research to well-funded researchers at elite institutions with FSRDC access. They enable educational use of real-world data, allowing students to develop analytical skills using the same data structures used in professional research, thereby training the next generation of health services researchers. By providing free, immediate access to rich ambulatory care data, public files stimulate a broader and more diverse research community, increase transparency in healthcare research, enable replication studies that strengthen scientific rigor, and empower community organizations and advocacy groups to conduct evidence-based analysis supporting their missions.",
      "which": "The public file contains the core set of variables most commonly used in ambulatory care research, including detailed diagnostic codes (ICD-10-CM), procedure codes (CPT), medication information (therapeutic class and generic names), patient demographics (age, sex, race/ethnicity, insurance type), visit characteristics (reason for visit, time spent, disposition), and provider characteristics (specialty, setting type). Geographic information is limited to broad census regions (rather than state or county) to protect confidentiality. Some sensitive or rare variables available in restricted files are suppressed or aggregated in the public version, and extreme values may be top-coded to prevent identification of unusual cases. Despite these protections, the public file retains sufficient detail to support the vast majority of ambulatory care research questions and publications.",
      "how": "Researchers access public files by navigating to the NCHS website, locating the NAMCS data page, selecting the desired data year, reviewing the data use agreement acknowledging appropriate use and citation requirements, and clicking download links to obtain data files, documentation, and supporting materials. Downloaded files can be immediately opened in statistical software packages without any conversion or special processing, though users must apply the provided survey weights and account for complex survey design in their analyses to generate valid national estimates. NCHS provides example code and analysis tutorials to help new users properly implement weighted analyses, calculate correct standard errors, and interpret results, with technical support available through email for users encountering difficulties."
    },
    {
      "id": "restricted_file",
      "label": "Restricted file",
      "detail": "Secure microdata tier with broader detail and possible linked products",
      "group": "sub",
      "who": "Primary users are experienced researchers at universities, government agencies, and research institutions who have obtained Special Sworn Status with the Census Bureau and approval from the NCHS Ethics Review Board for specific research projects requiring detailed data. Health services researchers studying geographic variation in care quality, healthcare economists analyzing market competition and provider behavior, and epidemiologists investigating rare conditions or small population subgroups utilize restricted files when public data lacks sufficient detail. Policy analysts at federal and state agencies conducting official program evaluations and researchers with approved projects requiring linkage to mortality records, housing data, or other external sources also access restricted files.",
      "what": "The restricted use file is an enhanced microdata file containing more granular detail than public files across multiple dimensions including finer geographic identifiers (state, metropolitan statistical area), additional clinical variables that might be suppressed in public files due to small cell sizes, more precise continuous variables (rather than categorized), and linkage keys enabling connection to external data sources like the National Death Index or HUD administrative records. These files maintain the visit-level record structure and include all variables available in public files plus additional sensitive or identifying variables that require controlled access for confidentiality protection. The enhanced detail enables research questions that cannot be adequately addressed with public data, such as small-area geographic studies, analyses of rare conditions, or studies requiring linked outcomes and social determinants data.",
      "when": "Restricted files become available 24-30 months after the end of each data collection year, following the more extensive disclosure review processes required for files with greater re-identification risk. Researchers can access restricted files only after completing a formal proposal review process, obtaining Special Sworn Status, and receiving project-specific approval, which typically takes 3-6 months from initial application submission. Once approved, researchers have access to the data for the duration of their approved project period (typically 1-3 years, renewable upon request), and can work with multiple data years simultaneously if approved for longitudinal research spanning multiple collection periods.",
      "where": "Restricted files are accessible exclusively within the secure computing environment of the Federal Statistical Research Data Center (FSRDC) network, which includes approximately 30 physical locations at universities, Census Bureau offices, and federal agencies distributed across the United States. Researchers must either travel to one of these physical locations and work in secure rooms with monitored computers isolated from external networks, or access data through secure remote access infrastructure providing virtual desktop connections to FSRDC computing environments. All computing occurs in isolated environments with no internet access, no ability to transfer files directly, and comprehensive logging of all activities to ensure compliance with data security requirements.",
      "why": "Restricted files enable critically important research that cannot be conducted with disclosure-protected public data, including studies of geographic variation in healthcare quality and access that require state or local-level geographic identifiers, analyses of rare diseases or treatments where small sample sizes would be suppressed in public files, and investigations of health disparities in small demographic subgroups. They support linkage studies that connect ambulatory care encounters with long-term mortality outcomes, social determinants data, or subsequent healthcare utilization, enabling comprehensive assessment of care quality and effectiveness. The controlled access model balances the imperative to protect patient confidentiality with the research community's need for detailed data, ensuring that sensitive research advancing public health knowledge can proceed while maintaining rigorous privacy protections.",
      "which": "Geographic variables in restricted files include state identifiers, Core-Based Statistical Area (CBSA) codes for metropolitan areas, and potentially finer geographic units for certain research purposes, compared to only broad census regions in public files. Additional clinical detail may include specific rare diagnosis codes, detailed procedure codes, more granular medication information, and provider characteristics that are suppressed or aggregated in public versions. Sensitive demographic variables such as more detailed race/ethnicity categories, specific insurance plan types, or patient country of origin may be available when justified by research needs. Linkage keys enable connection to external data sources including NDI mortality records, HUD housing assistance data, and potentially other administrative datasets approved on a project-specific basis.",
      "how": "Researchers begin by developing a detailed research proposal describing their research questions, methodology, why restricted data access is necessary, public benefit justification, and data security plan, which is submitted to the NCHS Ethics Review Board through the FSRDC application system. Upon approval, researchers complete Special Sworn Status certification with the Census Bureau, involving background checks, security training, and taking an oath to protect confidentiality with significant legal penalties for violations. Approved researchers schedule time at a physical FSRDC facility or obtain remote access credentials, work with data in the secure environment using provided statistical software (SAS, STATA, R), and submit all output for disclosure review by RDC administrators who examine results for potential confidentiality risks before release. The entire process is designed to maximize data utility for important research while maintaining multiple layers of protection for individual privacy and data security."
    },
    {
      "id": "biannual_prelim",
      "label": "Biannual prelim",
      "detail": "Periodic preliminary estimate cadence that improves timeliness",
      "group": "sub",
      "who": "Primary users include public health officials at federal, state, and local health departments who need current data to inform outbreak response, program planning, and resource allocation decisions on compressed timelines. Healthcare system leaders, hospital administrators, and clinical practice managers use preliminary estimates to track emerging care patterns and adjust protocols or resource deployment in response to changing population health needs. Policy makers in legislative and executive branches at multiple levels of government, journalists covering healthcare topics, and advocacy organizations working on timely health policy issues rely on these rapid-release estimates for evidence-based decision making and public communication.",
      "what": "Biannual preliminary estimates are rapid-turnaround statistical summaries of recent ambulatory care patterns released every six months through interactive dashboard interfaces, providing early insights into care delivery trends before final microdata files undergo complete processing and disclosure review. These estimates cover core metrics including visit volume and rates, top diagnoses and procedures, medication prescribing patterns, preventive service delivery rates, and demographic breakdowns of patients receiving care, presented with appropriate statistical uncertainty measures and methodological caveats. The preliminary designation indicates that estimates may be revised in final data releases as additional quality assurance and weighting refinements are applied, but they provide sufficiently reliable snapshots to inform time-sensitive decisions while accepting slightly higher uncertainty than final estimates.",
      "when": "Preliminary estimates are released on a fixed biannual schedule with spring and fall publication dates, typically providing data for the preceding 6-month period approximately 3-6 months after that period ends. For example, July-December data might be released in the following spring (March-May), and January-June data released in fall (September-November). This release cadence provides data 12-18 months faster than final annual microdata files, dramatically improving timeliness for users who need current intelligence on healthcare delivery patterns. The predictable schedule allows stakeholders to plan for data availability and integrate NAMCS preliminary estimates into their regular decision-making cycles and reporting timelines.",
      "where": "Preliminary estimates are published through public-facing interactive dashboards hosted on the NCHS website and CDC data visualization platforms, accessible to anyone with an internet connection and web browser without registration or special permissions. The dashboards are optimized for both desktop and mobile access, enabling users to explore preliminary data from offices, homes, or while traveling. Released estimates also appear in NCHS data briefs, vital statistics reports, and other publications disseminated through CDC communication channels including social media, email alerts, and press releases to ensure broad awareness and accessibility.",
      "why": "Biannual preliminary estimates address the critical tension between data quality and timeliness that has historically limited the utility of survey data for responding to emerging health trends, policy windows, and urgent decision needs. By accepting slightly less complete quality assurance in exchange for much faster release, preliminary estimates enable evidence-informed responses to seasonal disease patterns, emerging health threats, policy changes, or practice innovations while they are still current and actionable. This timeliness improves the policy relevance of NAMCS data, expands its impact on real-world decision making, and responds to longstanding stakeholder requests for more rapid data availability, ultimately increasing the return on investment in data collection by making insights available when they matter most.",
      "which": "Preliminary estimates typically focus on high-priority indicators most relevant for monitoring current healthcare delivery patterns, including overall visit rates by patient demographics, top 20 primary diagnoses, most frequently prescribed medication classes, preventive service delivery rates (vaccinations, cancer screenings, counseling), chronic disease management indicators, and utilization of telemedicine or other emerging care modalities. The specific metrics included may vary based on current public health priorities, seasonal patterns (such as influenza monitoring in winter releases), or emerging issues requiring surveillance. Estimates are presented with confidence intervals indicating statistical uncertainty and clear notation of their preliminary status, with links to methodology documentation explaining data collection, weighting procedures, and limitations.",
      "how": "Recent EHR encounter submissions undergo automated data quality checks, cleaning procedures, and preliminary weighting adjustments using expedited processes that balance speed with statistical rigor, accepting some additional uncertainty to enable faster release. Statistical analysts generate pre-specified tabulations of key metrics using the preliminary weighted data, calculating point estimates, confidence intervals, and trend comparisons with prior periods while flagging estimates with high uncertainty or potential quality issues. These tabulations populate interactive dashboard databases that generate visualizations dynamically based on user queries, with all preliminary estimates clearly labeled and accompanied by methodological notes explaining their preliminary nature, expected revision timelines, and appropriate use considerations. Quality flags alert users to estimates based on small sample sizes or exhibiting unusual patterns that warrant cautious interpretation."
    },
    {
      "id": "download_tables",
      "label": "Download tables",
      "detail": "Exportable tables for reporting and sharing",
      "group": "sub",
      "who": "Primary users include public health program coordinators and grant writers who need to incorporate current ambulatory care statistics into funding proposals, progress reports, and program justifications. Healthcare quality improvement teams, clinical practice managers, and medical educators download tables to include in presentations, training materials, and quality dashboards for internal audiences. Communications specialists at health departments, advocacy organizations, and professional associations use exported tables and charts to create fact sheets, policy briefs, infographics, and social media content that translate data insights for public audiences without requiring statistical software skills.",
      "what": "Download tables are pre-formatted, publication-ready statistical tables and data visualizations that users can export directly from interactive dashboards in various file formats, containing estimates, confidence intervals, sample sizes, and appropriate annotations about data quality and methodology. These exports preserve professional formatting, include proper citations and source information, maintain statistical precision appropriate for the estimates presented, and come with embedded metadata explaining variables, units, and calculation methods. The downloadable content ranges from simple frequency tables showing visit counts and percentages to complex multi-way cross-tabulations comparing metrics across multiple demographic groups, time periods, or clinical categories, all formatted for immediate inclusion in reports and presentations.",
      "when": "Download functionality is available continuously once preliminary or final estimates are published through dashboard interfaces, with new downloadable tables becoming available with each biannual dashboard update cycle. Users can generate and export tables on-demand whenever they access the dashboard system, allowing flexible timing aligned with their reporting deadlines, presentation schedules, or publication needs. Exported tables remain valid until the next data release, at which point users may choose to update their downloads with revised estimates or additional time periods, ensuring access to the most current available data for their reporting purposes.",
      "where": "Download capabilities are embedded directly within the interactive dashboard interfaces accessible through the NCHS website, with export buttons and menu options integrated into each visualization, table, and chart view. Downloaded files are saved to the user's local device (computer, tablet, or smartphone) through standard browser download mechanisms, creating local copies that users can then incorporate into documents, upload to content management systems, share via email, or archive for future reference. No special software is required to view or use downloaded files beyond standard office productivity tools (spreadsheet programs, presentation software, image viewers) commonly available on most computing devices.",
      "why": "Download functionality dramatically reduces the technical barriers and time required to incorporate NAMCS data into communications and decision-making products, eliminating the need for users to manually recreate tables from on-screen dashboards or write custom code to generate publication-ready output. By providing properly formatted, citation-included, quality-assured exports, the system prevents transcription errors, ensures correct statistical presentation, and promotes proper attribution of data sources that might be overlooked if users created tables manually. This capability expands the reach and impact of NAMCS data by enabling efficient dissemination through reports, presentations, publications, and public communications, ultimately increasing the return on data collection investment by making insights easily shareable across organizational and sectoral boundaries.",
      "which": "Export format options typically include CSV (comma-separated values) files for import into statistical software or custom analysis, Excel spreadsheet files with formatted cells and embedded formulas for further manipulation in familiar business tools, PDF documents preserving exact layouts for professional reports and publications, and image files (PNG, JPEG, SVG) of charts and graphs suitable for presentations, websites, and print materials. Users can choose between exporting individual tables or visualizations one at a time for focused inclusion in documents, or batch-downloading multiple related tables simultaneously for comprehensive reporting needs. Some dashboard systems offer customization options allowing users to select which variables, statistics, or time periods to include in exports, creating tailored downloads that match their specific communication requirements.",
      "how": "Users interact with dashboards to create the specific view, table, or visualization they need using dropdown menus, filters, and display options, then click clearly labeled export or download buttons typically positioned near the top or bottom of each dashboard component. The system generates the requested export file format in real-time, applying appropriate formatting, including methodological footnotes and citations, and presenting a download dialog or directly saving the file to the user's downloads folder. For tabular exports, the system includes column headers, row labels, numeric precision appropriate to the statistical uncertainty, and notes about suppressed cells or data quality flags, while chart exports preserve legends, axis labels, titles, and source citations in publication-quality resolution. All exports automatically include standardized language citing NAMCS as the data source with links to complete documentation, ensuring proper attribution and enabling recipients of shared materials to access additional information or verify estimates independently."
    },
    {
      "id": "hud_link",
      "label": "HUD link",
      "detail": "Link to housing assistance participation to add social context",
      "group": "sub",
      "who": "Primary users are social determinants of health researchers investigating how housing stability, affordability, and quality influence healthcare access, utilization patterns, and health outcomes across diverse populations. Urban health researchers, health economists, and policy analysts studying the intersection of housing policy and health policy use these linkages to evaluate the health impacts of housing assistance programs and inform cross-sectoral policy development. Community health researchers, health equity investigators, and population health scientists examining disparities in health and healthcare among economically vulnerable populations rely on HUD linkages to understand how housing assistance participation relates to ambulatory care patterns and health status.",
      "what": "The HUD linkage connects NAMCS ambulatory care encounter records with Department of Housing and Urban Development administrative data capturing participation in federal housing assistance programs, including public housing, Housing Choice Voucher Program (Section 8), and other HUD-administered rental assistance initiatives. The linked file adds variables indicating whether patients were receiving housing assistance at the time of their ambulatory care encounter, the type and duration of assistance received, household characteristics captured in HUD records, and housing unit characteristics such as location and building type. This enriched dataset enables researchers to examine healthcare utilization patterns, diagnoses, treatments, and outcomes in the context of housing assistance status, supporting analyses of how housing stability and affordability intersect with health and healthcare access.",
      "when": "HUD linkages are available for approved research projects following successful proposal review, Special Sworn Status authorization, and project-specific approval for access to linked data, with the application and approval process typically requiring 3-6 months before data access begins. The linkage reflects housing assistance participation status during time periods that align with ambulatory care encounter dates, though exact timing depends on the availability of HUD administrative records and the lag required for completing matching procedures. Researchers typically access HUD-linked files 2-3 years after encounter data collection to allow time for HUD data to be finalized and matching algorithms to be executed and validated.",
      "where": "HUD-linked NAMCS data files are classified as restricted-use data and are accessible exclusively within the secure computing environment of Federal Statistical Research Data Centers (FSRDCs), either through physical access at approximately 30 RDC locations distributed across the United States or via secure remote access virtual desktop infrastructure. The linked files exist only within the isolated FSRDC network and cannot be downloaded or transferred outside the secure environment, ensuring protection of potentially re-identifiable linked information. All analytical work occurs within monitored computing environments with comprehensive security protocols, and all research output undergoes formal disclosure review before release to researchers.",
      "why": "HUD linkages address critical knowledge gaps about the relationship between housing circumstances and health by providing empirical data connecting housing assistance participation with healthcare utilization, clinical diagnoses, treatment patterns, and potentially health outcomes when combined with mortality linkages. This enables research on fundamental questions such as whether housing assistance improves healthcare access, how housing instability manifests in ambulatory care patterns, whether different types of housing assistance show different health impacts, and which populations benefit most from housing support in terms of health outcomes. Such research generates evidence to inform more integrated and effective social and health policies, supports arguments for cross-sectoral investment in housing as a health intervention, and helps identify opportunities to coordinate housing assistance and healthcare delivery for vulnerable populations.",
      "which": "The linkage captures participation in major HUD housing assistance programs including traditional public housing developments operated by local public housing authorities, the Housing Choice Voucher Program (Section 8) providing tenant-based rental subsidies, project-based rental assistance programs subsidizing specific housing units, and other HUD-administered affordable housing initiatives. Linked variables may include program type, participation start and end dates, household composition, household income levels, rent burden, housing unit characteristics (size, location, building type), and neighborhood characteristics where available. Researchers can analyze overall housing assistance participation or differentiate between specific program types depending on research questions, sample sizes, and disclosure review considerations.",
      "how": "HUD linkage is accomplished through probabilistic record matching algorithms that compare personal identifiers and address information from NAMCS encounter records with HUD administrative databases containing housing assistance participant records, using specialized software that accounts for data entry variations, missing values, and changes over time. The matching process uses variables such as name, date of birth, Social Security Number (when available), and residential address to identify likely matches while calculating match probability scores based on agreement patterns across multiple identifiers. Matching is conducted by authorized data linking specialists in secure environments following privacy-preserving protocols established through interagency data sharing agreements between NCHS, Census Bureau, and HUD. Approved researchers receive analytical files where matched records are connected via anonymous linkage keys with all direct personal identifiers removed, and match quality information is provided to support sensitivity analyses examining potential bias from imperfect linkage."
    },
    {
      "id": "ndi_link",
      "label": "NDI link",
      "detail": "Link to mortality records to enable downstream outcome analysis",
      "group": "sub",
      "who": "Primary users are health services researchers and clinical epidemiologists conducting survival analysis, mortality risk assessment, and healthcare quality evaluation studies that require long-term outcome ascertainment following ambulatory care encounters. Cancer researchers, cardiovascular disease specialists, and chronic disease epidemiologists studying disease progression and treatment effectiveness rely on mortality linkages to measure outcomes in population-based samples beyond the limits of single health systems. Health economists evaluating the cost-effectiveness of interventions, health equity researchers examining mortality disparities across demographic groups, and outcomes researchers assessing the prognostic value of ambulatory care patterns use NDI linkages to connect healthcare encounters with definitive mortality outcomes.",
      "what": "The NDI linkage connects NAMCS ambulatory care encounter records with National Death Index mortality records maintained by NCHS, adding variables indicating whether patients died following their encounter, the date of death, underlying cause of death coded using ICD classification systems, and contributing causes of death captured on death certificates. This enriched dataset enables researchers to conduct survival analyses examining time from ambulatory care encounter to death, assess mortality risk factors identified during encounters, evaluate whether specific diagnoses or treatments are associated with better or worse survival outcomes, and calculate cause-specific mortality rates for patients with different ambulatory care patterns. The linkage provides complete mortality follow-up for the U.S. population regardless of where death occurred, overcoming limitations of health system-specific data that lose track of patients who die outside their origin system.",
      "when": "NDI linkages are available for approved research projects following successful proposal review, Special Sworn Status certification, and project-specific approval for linked data access, with the full approval process typically requiring 3-6 months before data access begins. Mortality linkage can provide follow-up from the date of ambulatory encounter through the most recent year for which NDI records have been finalized (typically with a 2-3 year lag from current date), enabling both short-term and long-term mortality follow-up studies depending on the encounter year and analysis timing. Researchers can request updates to mortality linkages as additional NDI years become available, supporting studies with extended follow-up periods or enabling cohort studies that add new encounter years while extending follow-up on earlier cohorts.",
      "where": "NDI-linked NAMCS data files are classified as restricted-use data accessible exclusively within Federal Statistical Research Data Centers (FSRDCs), either through physical access at approximately 30 secure RDC locations across the United States at universities, Census Bureau offices, and federal agencies, or through secure remote access infrastructure providing virtual desktop connections. All analytical work occurs in isolated computing environments with no external network connectivity, comprehensive activity logging, and multi-layered security controls to protect the confidentiality of potentially re-identifiable linked mortality information. Researchers cannot download or transfer linked data files outside the FSRDC environment, and all research output must successfully pass disclosure review examining results for potential confidentiality risks before release.",
      "why": "NDI linkages transform NAMCS from a cross-sectional snapshot of ambulatory care encounters into a powerful resource for longitudinal outcomes research by enabling mortality follow-up and survival analysis that would otherwise be impossible with encounter data alone. This capability is essential for evaluating the quality and effectiveness of ambulatory care by assessing whether patients with certain characteristics, diagnoses, or treatment patterns experience better or worse long-term survival, identifying ambulatory care interventions associated with reduced mortality risk, and detecting healthcare quality problems through excess mortality signals. Mortality linkages support critical public health research on disease burden, health disparities, and population health trends, enable cost-effectiveness analyses that require long-term outcome data, and provide gold-standard outcome ascertainment that is complete, standardized, and independent of healthcare system follow-up, ultimately producing stronger evidence to guide clinical practice and health policy.",
      "which": "The linkage provides mortality status (deceased or alive as of the most recent NDI year), date of death with month and year precision for deceased individuals, underlying cause of death representing the primary condition that initiated the chain of events leading to death (coded using ICD-10 classification), and multiple contributing causes of death listed on death certificates that provide additional context about comorbid conditions and complications. Researchers can analyze all-cause mortality (death from any cause) or cause-specific mortality focusing on particular diseases or injury types most relevant to their research questions. The linkage typically achieves match rates above 90% depending on the completeness of identifying information in NAMCS encounter records, with match quality variables provided to support sensitivity analyses addressing potential linkage bias.",
      "how": "NDI linkage is performed by NCHS mortality data specialists using probabilistic record matching algorithms that compare personal identifiers from NAMCS encounter records (name, Social Security Number, date of birth, sex, race, marital status, state of residence) with corresponding identifiers in the National Death Index database containing records for all deaths occurring in the United States. The matching algorithm calculates probability scores for potential matches based on agreement patterns across multiple identifiers, accounting for data entry errors, name changes, missing values, and demographic variations, with match thresholds established through validation studies to optimize sensitivity and specificity. The matching process follows strict privacy-protecting protocols with matching conducted in secure NCHS environments and match quality assessed through clerical review of uncertain matches and comparison with external validation sources. Approved researchers receive analytical files where matched encounters have mortality variables appended using anonymous linkage keys with all direct personal identifiers removed, along with match weight variables enabling sensitivity analyses that account for linkage uncertainty in statistical models."
    }
  ],
  "links": [
    { "source": "hub", "target": "microdata", "type": "partOf" },
    { "source": "hub", "target": "dashboards", "type": "partOf" },
    { "source": "hub", "target": "linkage", "type": "partOf" },
    { "source": "microdata", "target": "public_file", "type": "contains" },
    { "source": "microdata", "target": "restricted_file", "type": "contains" },
    { "source": "dashboards", "target": "biannual_prelim", "type": "contains" },
    { "source": "dashboards", "target": "download_tables", "type": "contains" },
    { "source": "linkage", "target": "hud_link", "type": "contains" },
    { "source": "linkage", "target": "ndi_link", "type": "contains" }
  ]
}
